krapyv/stm32-i2c-driver/i2c.c
                else if (hi2c.index == hi2c.RxLength - 2)
                {
                    // if BTF is fired, byte N - 1 in DR, byte N in shift register

                    // set STOP high (we have all the bytes we need)
                    hi2c.Instance->CR1 |= (1 << 9);

                    // read bytes N - 1 and N
                    hi2c.pRxBuffPtr[hi2c.index++] = hi2c.Instance->DR; // N - 1

                    hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR; // N
                }
            }
            break;

        case I2C_TX_RX:
            if (hi2c.phase == I2C_TX_RX_WRITE)
            {
                // repeated start
                hi2c.Instance->CR1 |= (1 << 8);
                // reset index
                hi2c.index = 0;

                // flip the phase value
                hi2c.phase = I2C_TX_RX_READ;
            }
            else if (hi2c.phase == I2C_TX_RX_READ)
            {
                // no BTF is possible (shift register never fills with nothing behind it)
                // N = 2 case
                if (hi2c.RxLength == 2)
                {
                    // after BTF is read, we have the byte 1 in the DR, the byte 2 in the shift register

                    // issue STOP
                    hi2c.Instance->CR1 |= (1 << 9);

                    // read both bytes (after the byte 1 is read, the byte 2 immediately drops from shift register to the DR)
                    hi2c.pRxBuffPtr[0] = hi2c.Instance->DR; // byte 1
                    hi2c.pRxBuffPtr[1] = hi2c.Instance->DR; // byte 2
                }
                else if (hi2c.RxLength >= 3)
                {
                    if (hi2c.index == hi2c.RxLength - 3)
                    {
                        // if BTF is fired, byte N - 2 in DR, byte N - 1 in shift register

                        // clear ACK bit 10 in CR1
                        hi2c.Instance->CR1 &= ~(1 << 10);

                        // read data N-2
                        hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR;
                        hi2c.index++;

                        break;
                    }

                    else if (hi2c.index == hi2c.RxLength - 2)
                    {
                        // if BTF is fired, byte N - 1 in DR, byte N in shift register

                        // set STOP high (we have all the bytes we need)
                        hi2c.Instance->CR1 |= (1 << 9);

                        // read bytes N - 1 and N
                        hi2c.pRxBuffPtr[hi2c.index++] = hi2c.Instance->DR; // N - 1

                        hi2c.pRxBuffPtr[hi2c.index] = hi2c.Instance->DR; // N
                    }
                }
            }

            break;
        }
    }
    // RxNE bit 6 in SR1 caused interrupt
    else if (sr1_snapshot & (1 << 6))
    {

        if (hi2c.RxLength == 1)
        {
            // stop is already set after the clearing of the ADDR

            // read the byte
            hi2c.pRxBuffPtr[0] = hi2c.Instance->DR;

            // enabled ACK
            hi2c.Instance->CR1 |= (1 << 10);

            // ITBUFEN is not disabled
        }

        // RxLength == 2 does not use RxE

        // RxLength >= 3
        else if (hi2c.RxLength >= 3)
        {
            if (hi2c.index < hi2c.RxLength - 2)
            {
                hi2c.pRxBuffPtr[hi2c.index++] = hi2c.Instance->DR;

                if (hi2c.index == hi2c.RxLength - 3)
                {
                    // disable ITBUFEN, so the last two bytes are BTF-only
                    hi2c.Instance->CR2 &= ~(1 << 10);
                }
            }
        }
    }
    // TxE bit 7 in SR1 caused interrupt
    else if (sr1_snapshot & (1 << 7))
    {
        if (hi2c.index < hi2c.TxLength)
        {
            if (hi2c.index == hi2c.TxLength - 1)
            {
                // disable ITBUFEN
                hi2c.Instance->CR2 &= ~(1 << 10);
            }
            hi2c.Instance->DR = hi2c.pTxBuffPtr[hi2c.index++];
        }
    }

    return;
}

// Error Interrupts Handler (priority 39 - can be preempted by I2C1_EV)
void I2C1_ER_IRQHandler(void)
{
    // disable interrupts
    __disable_irq();

    // populate the error_code

    // make snapshot of current state of SR1
    uint16_t sr1_snap = hi2c.Instance->SR1;

    uint16_t sr1_errors_snap = (sr1_snap & ((uint16_t)0xF << 8));

    // isolate the errors bits 11:8 and assigning to the error_code
    // 0b00001111 = 2^3 + 2^2 + 2^1 + 2^0 = 8 + 4 + 2 + 1 = 15 = 0xF
    hi2c.error_code = sr1_errors_snap;

    // error code checking branches
    if (hi2c.error_code & I2C_ERROR_BERR)
    {
        // needs SWRST hard reset

        // since I immediately enable SWRST, there is no explicit SR1 error flag clearing
        // the SR1 flags cleared immediately by SWRST

        // set SWRST to 1
        hi2c.Instance->CR1 |= (1 << 15);

        // clear the pending EV interrupt
        // I2C1_EV has a position of 31
        // one ICPR has 32 Interrupt-related bits (0...31)

        // with NVIC the write-1-to-clear is the tool that allows to prevent race conditions if another interrupt fires mid-execution
        NVIC->ICPR[0] = (1 << 31);
    }
    else
    {
        if (hi2c.error_code & I2C_ERROR_ARLO)
        {
            // needs to wait until the current transmission is over because the another master seized the bus

            // clear the SR1 ARLO error flag
            // a single write to prevent late-incoming bits to SR1 from overwriting
            // bits 13 and 5 are reserved bits, write 0 to them
            hi2c.Instance->SR1 = ~((1 << 13) | (1 << 9) | (1 << 5));

            // no stop issuing since the microcontroller is no longer a master
        }
        if (hi2c.error_code & I2C_ERROR_AF)
        {
            // needs to issue STOP and then try the communication again

            // make snapshot of current CR1
            uint16_t cr1_snap = hi2c.Instance->CR1;
            uint32_t cr1_modified = cr1_snap;

            // clear the SR1 AF error flag
            // ~(1 << 10) = 11111011....
            hi2c.Instance->SR1 = ~((1 << 13) | (1 << 10) | (1 << 5));

            // check whether there was no ARLO error
            // if there is an ARLO error, that means that the microcontroler stopped being a master of the lines, it is now a target that just listens to the bus and waits when the controller that seized the bus concludes the communication.
            // AF recovery sequence however issues STOP. the MCU in target mode just releases the lines letting them float as a STOP sequence. so if there are both ARLO and AF errors simultaneously, the stop issuing in the AF Recovery sequence disappears
            if (!(sr1_errors_snap & I2C_ERROR_ARLO))
            {
                // issue STOP condition
                // set the STOP bit to 1
                cr1_modified |= (1 << 9);
            }

