krapyv/stm32-i2c-driver/i2c.c
    // set the range to 0x11
    I2C->TRISE |= (0x11 << 0);

    // ----- CR1 configuration ----- //

    // set bit 0 PE (Peripheral enabled) to 1

    I2C->CR1 |= (1 << 0);

    // set bit 10 ACK (Acknowledge enable) to 1
    // since this bit is set and cleared by software and cleared by hardware when PE = 0
    // it is enabled after PE became 1
    I2C->CR1 |= (1 << 10);

    /* ----- Interrupts enablement (NVIC) ----- */

    // I2C_EV has position 31 in the vector table
    // ISER[0] pos 31
    NVIC->ISER[0] = (1 << 31);

    // I2C_ER has position 32 in the vector table
    // ISER[1] pos 1
    NVIC->ISER[1] = (1 << 0);

    /* ----- Interrupts enablement (CR2) -----*/

    // set ITERREN (Error interrupt enable) Bit 8 to 1
    I2C->CR2 |= (1 << 8);

    // set ITEVTEN (Event interrupt enable) Bit 9 to 1
    I2C->CR2 |= (1 << 9);

    // the ITBUFEN will be enabled dynamically when we are actively ready to transmit or receive bytes
}

static uint8_t I2C_PollHardwareFlags(I2C_RegDef_t *I2C, I2C_Bit_Masks_t bit_mask)
{
    while (1)
    {
        uint32_t sr1_snap = I2C->SR1;

        // firstly, check the error flags
        if (sr1_snap & ((1 << 11) | (1 << 10) | (1 << 9) | (1 << 8)))
        {
            uint32_t cr1_snap = I2C->CR1;

            sr1_snap &= ~((1 << 11) | (1 << 10) | (1 << 9) | (1 << 8));

            // if there are errors, clear the error flags by writing 0 to them
            I2C->SR1 = sr1_snap;

            uint32_t cr1_modified = cr1_snap;

            // set the STOP bit to 1
            cr1_modified |= (1 << 9);
            // set the ACK bit to 1
            cr1_modified |= (1 << 10);
            // clear the POS bit
            cr1_modified &= ~(1 << 11);

            // direct write of the modified CR1 to I2C->CR1
            I2C->CR1 = cr1_modified;

            return 1;
        }

        // secondly, check the bit
        if (sr1_snap & bit_mask)
        {
            // if the bit is set, exit the loop
            return 0;
        }
    }
}

uint8_t I2C_PollHardwareBusy(I2C_RegDef_t *I2C)
{
    while (1)
    {
        uint32_t sr1_snap = I2C->SR1;
        uint32_t sr2_snap = I2C->SR2;

        // firstly, check the error flags
        if (sr1_snap & ((1 << 10) | (1 << 9) | (1 << 8)))
        {
            // if there are errors, clear the error flags by writing 0 to them
            I2C->SR1 &= ~((1 << 10) | (1 << 9) | (1 << 8));

            // generate STOP condition to gracefuly and safely release the lines
            I2C->CR1 |= (1 << 9);

            return 1;
        }

        if (!(sr2_snap & (1 << 1)))
        {
            // if the BUSY bit is 0, exit the loop
            return 0;
        }
    }
}

I2C_Status_t I2C_Master_Transmit(uint8_t slave_addr, uint8_t *data, uint8_t length)
{
    if (hi2c.Instance == NULL || data == NULL || length == 0)
    {
        return I2C_ERROR;
    }

    hi2c.slave_add = slave_addr;
    hi2c.pTxBuffPtr = data;
    hi2c.TxLength = length;
    hi2c.mode = I2C_TX;
    hi2c.index = 0;
    hi2c.error_code = 0;
    hi2c.state = I2C_STATE_TX_ADDR;

    // wait until the bus is completely idle (BUSY = 0)
    if (I2C_PollHardwareBusy(hi2c.Instance))
    {
        return I2C_ERROR;
    }

    // start the transaction by issuing START (set to 1)
    hi2c.Instance->CR1 |= (1 << 8);
    // START is cleared by hardware when start is sent

    return I2C_OK;
}

// I2C_Status_t I2C_Master_Transmit(I2C_HandleTypeDef *hi2c, uint8_t slave_addr, uint8_t *data, uint8_t length)
// {
//     if (hi2c == NULL || hi2c->Instance == NULL || data == NULL || length == 0)
//     {
//         return I2C_ERROR;
//     }

//     // declare a local I2C var to simplify the naming
//     I2C_RegDef_t *I2C = hi2c->Instance;

//     // wait until the bus is completely idle (BUSY = 0)
//     if (I2C_PollHardwareBusy(I2C))
//     {
//         return I2C_ERROR;
//     }

//     // start the transaction by issuing START (set to 1)
//     I2C->CR1 |= (1 << 8);
//     // START is cleared by hardware when start is sent

//     // polling the SB (Start bit)
//     // when exit, the bit is set, start condition generated
//     if (I2C_PollHardwareFlags(I2C, I2C_SB_MASK))
//     {
//         return I2C_ERROR;
//     }

//     // SB is cleared by reading SR1 (done in the poll above) + writing DR
//     // SR1 read is already consumed by the polling loop - writing DR now completes the clear

//     // write the slave address to the DR register (it will start sending the bits to the slave and clear the SB bit)
//     // 7 bit slave address + W (Write) bit 0
//     I2C->DR = (slave_addr << 1) & ~0x01; // 0x01 = 2^0 = 1 = (1 << 0)

//     // polling the ADDR (Address sent) bit
//     // the bit is set after the ACK of the byte
//     if (I2C_PollHardwareFlags(I2C, I2C_ADDR_MASK))
//     {
//         return I2C_ERROR;
//     }

//     // read the SR1 and SR2 to clear the ADDR bit in the SR1
//     // SR1 read is already consumed by the polling loop above - reading SR2 now completes the clear
//     uint32_t dummy = I2C->SR2;
//     (void)dummy; // preventing the compiler warnings of an unused variable

//     // ensure we are the Master (MSL, bit 0 = 1) and Transmitter (TRA, bit 2 = 1)
//     // 0b0101 = 2^2 + 2^0 = 4 + 1 = 5 = 0x05
//     if ((dummy & ((1 << 2) | (1 << 0))) != 0x05)
//     {
//         // if we enter this if body, the hardware is desynchronized
//         // force STOP
//         I2C->CR1 |= (1 << 9);
//         return I2C_ERROR;
//     }

//     for (uint8_t i = 0; i < length; i++)
//     {
//         // polling the TxE Transmitters Data register empty
//         // goes high after every byte leaves the DR
//         if (I2C_PollHardwareFlags(I2C, I2C_TXE_MASK))
//         {
//             return I2C_ERROR;
//         }

//         I2C->DR = data[i];
//     }

//     // before sending the STOP condition
//     // we need to make sure the byte has left the shift register, so we are not going to corrupt the last byte mid-sending
//     // polling the Byte transfer finished
//     if (I2C_PollHardwareFlags(I2C, I2C_BTF_MASK))
//     {
//         return I2C_ERROR;
//     }

//     // issuing the Stop generation
//     I2C->CR1 |= (1 << 9);

//     return I2C_OK;
// }

I2C_Status_t I2C_Master_Receive(I2C_HandleTypeDef *hi2c, uint8_t slave_addr, uint8_t *data, uint8_t length)
{
    if (hi2c == NULL || data == NULL || length == 0)
    {
        return I2C_ERROR;
    }

