krapyv/stm32-i2c-driver/i2c.c
    /* ---------- SHARED ADDR CLEARING ---------- */
    // clear the ADDR bit 1 in SR1
    dummy = I2C->SR1;
    dummy = I2C->SR2;

    // ensure we are the Master (MSL, bit 0 = 1) and Receiver (TRA, bit 2 = 0)
    // 0b0001 = 2^0 = 1 = 0x01
    if ((dummy & ((1 << 2) | (1 << 0))) != 0x01)
    {
        uint32_t cr1_snap = I2C->CR1;

        cr1_snap |= (1 << 9);
        cr1_snap |= (1 << 10);
        cr1_snap &= ~(1 << 11);
        // if we enter this if body, the hardware is desynchronized
        // force STOP
        I2C->CR1 = cr1_snap;

        return I2C_ERROR;
    }

    /* ---------- SHARED ADDR CLEARING ---------- */

    /* ---------- ONE-BYTE SCENARIO ---------- */
    if (receive_length == 1)
    {
        // generate the STOP condition to prevent the peripheral from sending unwanted bytes after the one we are asking for
        I2C->CR1 |= (1 << 9);

        // poll the RxNE
        // exits when the byte arrives
        if (I2C_PollHardwareFlags(I2C, I2C_RXNE_MASK))
        {
            return I2C_ERROR;
        }

        // once the byte arrives, read it to our variable
        *pReceive = I2C->DR;
    }

    /* ---------- TWO-BYTES SCENARIO ---------- */
    else if (receive_length == 2)
    {
        // poll BTF - we need to make sure that both bytes arrived: the first one is in the DR, the second is in the shift register
        if (I2C_PollHardwareFlags(I2C, I2C_BTF_MASK))
        {
            return I2C_ERROR;
        }

        // after the BTF is set, issue the STOP condition to prevent fetching of the third byte
        I2C->CR1 |= (1 << 9);

        // read the data
        for (uint8_t i = 0; i < receive_length; i++)
        {
            // poll RxNE
            if (I2C_PollHardwareFlags(I2C, I2C_RXNE_MASK))
            {
                return I2C_ERROR;
            }
            pReceive[i] = I2C->DR;
        }
    }
    /* ---------- TWO-BYTES SCENARIO ---------- */

    /* ---------- MULTI-BYTE SCENARIO ----------*/
    else if (receive_length >= 3)
    {

        // read the data
        for (uint8_t i = 0; i < receive_length - 2; i++)
        {
            // poll the RxNE
            // exits when the byte arrives
            if (I2C_PollHardwareFlags(I2C, I2C_RXNE_MASK))
            {
                return I2C_ERROR;
            }

            // once the byte arrived, read it to the array
            pReceive[i] = I2C->DR;
        }

        // poll the RxNE
        // exits when the byte arrives
        if (I2C_PollHardwareFlags(I2C, I2C_BTF_MASK))
        {
            return I2C_ERROR;
        }

        // the current byte is the second-to-last
        // to clear the ACK bit in CR1

        // since the bytes are ACKed/NACKed only during the transition from the shift register to the DR
        // after the byte N-2 is the DR and the byte N-1 is in the shift register, the N-1 byte receives ACK/NACK after the DR is free
        // so we can clear the ACK bit there
        I2C->CR1 &= ~(1 << 10);

        // once the byte arrived, read it to the array
        pReceive[receive_length - 2] = I2C->DR;

        // generate the STOP condition in CR1 after the last byte
        I2C->CR1 |= (1 << 9);

        pReceive[receive_length - 1] = I2C->DR;

        // wait until the STOP condition is detected by hardware
        while (I2C->CR1 & (1 << 9))
            ;
    }
    /* ---------- MULTI-BYTE SCENARIO ----------*/

    // after both bytes have been read, clear POS
    I2C->CR1 &= ~(1 << 11);

    // after all bytes have been read, re-enable the ACK bit in CR1
    I2C->CR1 |= (1 << 10);

    /* ----- READ PART ----- */

    return I2C_OK;
}